#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/lsy/gitops-demo-3/runs/run-wayGdmCjAxqhZPbU

Waiting for the plan to start...

Terraform v0.13.6
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

azurerm_resource_group.example: Refreshing state... [id=/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group]
module.network.data.azurerm_resource_group.network: Refreshing state... [id=/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group]
module.network.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group/providers/Microsoft.Network/virtualNetworks/acctvnet]
module.network.azurerm_subnet.subnet[0]: Refreshing state... [id=/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/subnet1]
module.aks.module.ssh-key.tls_private_key.ssh: Refreshing state... [id=30fd899412aaddfb3e4414ec97a0cbcca95c94b1]
module.aks.data.azurerm_resource_group.main: Refreshing state... [id=/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group]
module.aks.module.ssh-key.local_file.private_key[0]: Refreshing state... [id=38fa47fc44a985f2bc2ce309ff1bfe007872f225]
module.aks.azurerm_log_analytics_workspace.main[0]: Refreshing state... [id=/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group/providers/Microsoft.OperationalInsights/workspaces/prefix-workspace]
module.aks.azurerm_log_analytics_solution.main[0]: Refreshing state... [id=/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourcegroups/aks-resource-group/providers/Microsoft.OperationsManagement/solutions/ContainerInsights(prefix-workspace)]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + dns_prefix              = "prefix"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + kube_admin_config       = (known after apply)
      + kube_admin_config_raw   = (sensitive value)
      + kube_config             = (known after apply)
      + kube_config_raw         = (sensitive value)
      + kubelet_identity        = (known after apply)
      + kubernetes_version      = "1.19.6"
      + location                = "eastus"
      + name                    = "prefix-aks"
      + node_resource_group     = (known after apply)
      + private_cluster_enabled = true
      + private_dns_zone_id     = (known after apply)
      + private_fqdn            = (known after apply)
      + private_link_enabled    = (known after apply)
      + resource_group_name     = "aks-resource-group"
      + sku_tier                = "Free"

      + addon_profile {

          + azure_policy {
              + enabled = true
            }

          + http_application_routing {
              + enabled                            = true
              + http_application_routing_zone_name = (known after apply)
            }

          + kube_dashboard {
              + enabled = false
            }

          + oms_agent {
              + enabled                    = true
              + log_analytics_workspace_id = (known after apply)
              + oms_agent_identity         = (known after apply)
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + default_node_pool {
          + availability_zones    = [
              + "1",
              + "2",
            ]
          + enable_auto_scaling   = true
          + enable_node_public_ip = false
          + max_count             = 2
          + max_pods              = 110
          + min_count             = 1
          + name                  = "exnodepool"
          + node_count            = (known after apply)
          + node_labels           = {
              + "nodepool" = "defaultnodepool"
            }
          + orchestrator_version  = "1.19.6"
          + os_disk_size_gb       = 50
          + os_disk_type          = "Managed"
          + tags                  = {
              + "Agent" = "defaultnodepoolagent"
            }
          + type                  = "VirtualMachineScaleSets"
          + vm_size               = "Standard_D2s_v3"
          + vnet_subnet_id        = "/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/subnet1"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + linux_profile {
          + admin_username = "azureuser"

          + ssh_key {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC0m2qzdziXCsWECB7MWI6HzN/rl6TXEqzl6m5gsEFkO0ISFo66A2iIG9T+70WYt2+KeEXazScwsqp03kP5VQvXKgDkxPQ6vzRH1Q3oJqNQWc2SypGiiIlYBJfdwtKQNgdXR0RDZn+C1A4HOYifIsiz6Dq9Mi68uxBpMVzJZIuwNXLIGGehQhsguSny/PybuiAnDpr3SF5IjuprJB3vEw7OSPZoj/539HqJ+iKGbtSMHKZdlLQZWr2jCeM/0FcgOvGyqGoYx0qeM++L/DwSysRU8cfkE1Gu8UFFEGBonXJyVd7rt7w03Oxu1RJZVI8V2hJ3cxRFMp6JPouwYwiAWxkj"
            }
        }

      + network_profile {
          + dns_service_ip     = "172.21.0.10"
          + docker_bridge_cidr = "170.10.0.1/16"
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = "azure"
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + service_cidr       = "172.21.0.0/24"

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = true

          + azure_active_directory {
              + admin_group_object_ids = [
                  + "a4e76421-09aa-482f-866e-0c4ec3461c4a",
                ]
              + managed                = true
              + tenant_id              = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
        }
    }

  # module.aks.azurerm_log_analytics_solution.main[0] must be replaced
-/+ resource "azurerm_log_analytics_solution" "main" {
      ~ id                    = "/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourcegroups/aks-resource-group/providers/Microsoft.OperationsManagement/solutions/ContainerInsights(prefix-workspace)" -> (known after apply)
        location              = "eastus"
        resource_group_name   = "aks-resource-group"
        solution_name         = "ContainerInsights"
      - tags                  = {} -> null
        workspace_name        = "prefix-workspace"
      ~ workspace_resource_id = "/subscriptions/1336ece0-3256-4a2e-b051-e83ca0c7cd51/resourceGroups/aks-resource-group/providers/Microsoft.OperationalInsights/workspaces/prefix-workspace" -> (known after apply) # forces replacement

      ~ plan {
          ~ name      = "ContainerInsights(prefix-workspace)" -> (known after apply)
            product   = "OMSGallery/ContainerInsights"
            publisher = "Microsoft"
        }
    }

  # module.aks.azurerm_log_analytics_workspace.main[0] will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + daily_quota_gb             = -1
      + id                         = (known after apply)
      + internet_ingestion_enabled = true
      + internet_query_enabled     = true
      + location                   = "eastus"
      + name                       = "prefix-workspace"
      + portal_url                 = (known after apply)
      + primary_shared_key         = (sensitive value)
      + resource_group_name        = "aks-resource-group"
      + retention_in_days          = 30
      + secondary_shared_key       = (sensitive value)
      + sku                        = "PerGB2018"
      + workspace_id               = (known after apply)
    }

  # module.aks.module.ssh-key.local_file.private_key[0] will be created
  + resource "local_file" "private_key" {
      + content              = <<~EOT
            -----BEGIN RSA PRIVATE KEY-----
            MIIEowIBAAKCAQEAtJtqs3c4lwrFhAgezFiOh8zf65ek1xKs5epuYLBBZDtCEhaO
            ugNoiBvU/u9FmLdvinhF2s0nMLKqdN5D+VUL1yoA5MT0Or80R9UN6CajUFnNksqR
            ooiJWASX3cLSkDYHV0dEQ2Z/gtQOBzmInyLIs+g6vTIuvLsQaTFcyWSLsDVyyBhn
            oUIbILkp8vz8m7ogJw6a90heSI7qayQd7xMOzkj2aI/+d/R6ifoihm7UjBymXZS0
            GVq9ownjP9BXIDrxsqhqGMdKnjPvi/w8EsrEVPHH5BNRrvFBRRBgaJ1yclXe67e8
            NNzsbtUSWVSPFdoSd3MURTKeiT6LsGMIgFsZIwIDAQABAoIBACDEOZ2Jubideaw0
            lPHZ9zHoF4/0mTFz7+5ek9vy3kpC/f+uHALfb22SLxh5bJUCYrgqjfHeWofZQlel
            o4tuxJEqy7K1kOG/osqNetJtgB+py0QggD+OqexQGQVgvTbwtnA9O8NGq0efFVR2
            ObU1aFhLf6ynmBchkR6kmALpvPYgzgnwG6FfAowIGaKkzzlS3IOEPIk+SaSnJXE+
            Iu/EL3YlTv2spbitPxgXMEuph0ikzj05Xe/oo1DcyiOMQi5bJ2CuT3BAqsCEMT+W
            vBfHcgJwq5KvnCClLqyYTry/Myb66TYCOmm70Yoz35kPIv732HAA3BhWLelTwSRo
            4WAAoEECgYEA6HAP4FgBMiog1/3rZe3IYkJx1IvFaYzrtPb6bI4oUX7cHfoz6mCl
            fEMEiisRKPDKFaqNqlpG4zPg95dIrQdQBPh+QVQxT5I2/+0iCd0wKshWCmYNIenp
            8BQeKtFYv5B4pXIJzVJ888pQx2JMoYNPQW+yNXCEC7DBQKmOIEyh6RECgYEAxupP
            SaIpW3DrImbIxk1xHvH9BCNdsFTKOGqnxdW35o5SQIhKWaZWcqSyq18ouj5v6gIN
            uwu25oCN68e9q1U3y4fKIThVJtCWBjuCkrLsKaKZHPknf6SeQxJk+3p2LbCDsh0R
            AiIv2CF+WsqebSk9MIsxIR6cyK7bMyrJlias/vMCgYB1HGEja7POjqNVsD32cUPR
            HiE0MegZMkNgPkAWidmOlhhZkkKuCFvYq/uRkflnY0qud+xAtJOazfy/Qp3/b/vF
            RV53k+/0Y3sKn3PS/HrUU3PmcVyUhcK0j65TbH8Gpcfjs/10Ueda/ciNbN2nUv2P
            vrNPcY1WRoxYBBXz+ChrwQKBgGcSLKmD/JgkR8LYrbqLkE0vqSKGzNo85Vgcc/kA
            SD2Qi7BirtwLZAodq3M/aNQw3D7Od5zvcgO4o1GEe5SXIMU3BJb4IK9vL/3kwkEP
            s23TkjFALaZnf5ZTpr3kc+4y49rcUt7fJhmBKX8UNMltsAZCad+2hBk8+dpmlnRW
            cBffAoGBAIMM2wjy23QoWcAeeH8gY5BAygVHpHCCNvJsUZlo4PwlrG10xKg0YEec
            Y9NYFWuqakyIluLMm5r4YjQCpxBeJH7415giEOHvbXdpwk5PePWPvm0C7nM4CXau
            3baa+mT707mnq1RHt1hMSaCV5DpKz1XkSNnWDWrvr35B8Lw3hQ3l
            -----END RSA PRIVATE KEY-----
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./private_ssh_key"
      + id                   = (known after apply)
    }

Plan: 4 to add, 0 to change, 1 to destroy.
```

</details>

*Pusher: @waxb, Action: `pull_request`*